export const data = {
  "key": "v-ec4fbaf8",
  "path": "/docs/Tech/2024-03-15-%EC%9B%B9%EB%94%94%EC%9E%90%EC%9D%B4%EB%84%88%EA%B0%80-%EC%95%8C%EC%95%84%EC%95%BC%ED%95%A0-%EB%94%94%EC%9E%90%EC%9D%B8-%EA%B7%9C%EC%B9%99-16%EA%B0%80%EC%A7%80/",
  "title": "웹디자이너를 위한 16가지 디자인 규칙",
  "lang": "ko",
  "frontmatter": {
    "title": "웹디자이너를 위한 16가지 디자인 규칙",
    "description": "웹디자이너가 알아야할 디자인 규칙 16가지에 대한 번역과 함께 웹디자인의 핵심 가이드라인을 제공합니다.",
    "date": "2024-03-15 17:08",
    "sidebarDepth": 0,
    "tag": "Tech",
    "thumbnail": null
  },
  "excerpt": "",
  "headers": [
    {
      "level": 2,
      "title": "디자인 개선을 통해 디자인 규칙 소개",
      "slug": "디자인-개선을-통해-디자인-규칙-소개",
      "children": []
    },
    {
      "level": 2,
      "title": "1. 관련 요소를 그룹화하기 위해 공간 사용",
      "slug": "_1-관련-요소를-그룹화하기-위해-공간-사용",
      "children": []
    },
    {
      "level": 2,
      "title": "2. 일관성 유지",
      "slug": "_2-일관성-유지",
      "children": []
    },
    {
      "level": 2,
      "title": "3. 비슷한 모양의 요소는 비슷한 방식으로 작동하도록 보장",
      "slug": "_3-비슷한-모양의-요소는-비슷한-방식으로-작동하도록-보장",
      "children": []
    },
    {
      "level": 2,
      "title": "4. 명확한 시각적 계층 구조 생성",
      "slug": "_4-명확한-시각적-계층-구조-생성",
      "children": []
    },
    {
      "level": 2,
      "title": "5. 불필요한 스타일 제거",
      "slug": "_5-불필요한-스타일-제거",
      "children": []
    },
    {
      "level": 2,
      "title": "6. 색상을 목적적으로 사용하십시오",
      "slug": "_6-색상을-목적적으로-사용하십시오",
      "children": []
    },
    {
      "level": 2,
      "title": "7. 인터페이스 요소에 3:1 대비 비율이있는지 확인하십시오",
      "slug": "_7-인터페이스-요소에-3-1-대비-비율이있는지-확인하십시오",
      "children": []
    },
    {
      "level": 2,
      "title": "8. 텍스트에 4.5:1 대비 비율 보장",
      "slug": "_8-텍스트에-4-5-1-대비-비율-보장",
      "children": []
    },
    {
      "level": 2,
      "title": "9. 색상만을 지시자로 사용하지 않습니다",
      "slug": "_9-색상만을-지시자로-사용하지-않습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "10. 단일 산세리프 글꼴 사용",
      "slug": "_10-단일-산세리프-글꼴-사용",
      "children": []
    },
    {
      "level": 2,
      "title": "11. 소문자의 글자가 더 큰 산세리프 글꼴 사용",
      "slug": "_11-소문자의-글자가-더-큰-산세리프-글꼴-사용",
      "children": []
    },
    {
      "level": 2,
      "title": "12. 대문자 사용 제한",
      "slug": "_12-대문자-사용-제한",
      "children": []
    },
    {
      "level": 2,
      "title": "13. 정규 및 볼드 글꼴 두 가지만 사용",
      "slug": "_13-정규-및-볼드-글꼴-두-가지만-사용",
      "children": []
    },
    {
      "level": 2,
      "title": "14. 순수한 검은색 텍스트 사용 피함",
      "slug": "_14-순수한-검은색-텍스트-사용-피함",
      "children": []
    },
    {
      "level": 2,
      "title": "15. 줄 간격을 늘립니다",
      "slug": "_15-줄-간격을-늘립니다",
      "children": []
    },
    {
      "level": 2,
      "title": "16. 텍스트의 왼쪽 정렬 사용",
      "slug": "_16-텍스트의-왼쪽-정렬-사용",
      "children": []
    }
  ],
  "git": {
    "updatedTime": 1710827145000
  },
  "filePathRelative": "docs/Tech/2024-03-15-웹디자이너가-알아야할-디자인-규칙-16가지/README.md"
}
