export const data = {
  "key": "v-0e2cb7bb",
  "path": "/docs/Nextjs/2024-04-05-ReactJSBestPracticesFromTheNewDocs/",
  "title": "React JS의 새로운 문서에서의 예제",
  "lang": "ko",
  "frontmatter": {
    "title": "React JS의 새로운 문서에서의 예제",
    "description": "",
    "date": "2024-04-05 14:22",
    "sidebarDepth": 0,
    "tag": "Tech",
    "thumbnail": null,
    "originalTitle": "React JS Best Practices From The New Docs",
    "link": "https://medium.com/@sebastiancarlos/react-js-best-practices-from-the-new-docs-1c65570e785d"
  },
  "excerpt": "",
  "headers": [
    {
      "level": 2,
      "title": "새로운 React 문서를 읽을 시간이 없다면, 난 대신 그것들을 걸러 냈습니다.",
      "slug": "새로운-react-문서를-읽을-시간이-없다면-난-대신-그것들을-걸러-냈습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "소개",
      "slug": "소개",
      "children": []
    },
    {
      "level": 2,
      "title": "1. React는 처음에 Jordan Walke에 의해 만들어졌습니다.",
      "slug": "_1-react는-처음에-jordan-walke에-의해-만들어졌습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "2. 리액트에는 17명의 핵심 팀 멤버가 있어요.",
      "slug": "_2-리액트에는-17명의-핵심-팀-멤버가-있어요",
      "children": []
    },
    {
      "level": 2,
      "title": "3. 문서에서는 인터랙티브 코드 예시에 CodeSandbox를 사용해요.",
      "slug": "_3-문서에서는-인터랙티브-코드-예시에-codesandbox를-사용해요",
      "children": []
    },
    {
      "level": 2,
      "title": "4. 새 문서는 React의 다양한 사용 사례를 설명할 때 Vue에서 영감을 받았어요.",
      "slug": "_4-새-문서는-react의-다양한-사용-사례를-설명할-때-vue에서-영감을-받았어요",
      "children": []
    },
    {
      "level": 2,
      "title": "5. 간단한 HTML 페이지에 React를 추가하는 것은 쉬워요. 빌드 단계조차 필요하지 않아요.",
      "slug": "_5-간단한-html-페이지에-react를-추가하는-것은-쉬워요-빌드-단계조차-필요하지-않아요",
      "children": []
    },
    {
      "level": 2,
      "title": "6. 여러 개의 React 루트를 가질 수 있습니다.",
      "slug": "_6-여러-개의-react-루트를-가질-수-있습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "7. 새 문서에서는 더 이상 권장하지 않던 Create React App을 이제 추천하지 않습니다.",
      "slug": "_7-새-문서에서는-더-이상-권장하지-않던-create-react-app을-이제-추천하지-않습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "8. 프로덕션에 준비된 프로젝트를 위해 Next.js를 추천합니다.",
      "slug": "_8-프로덕션에-준비된-프로젝트를-위해-next-js를-추천합니다",
      "children": []
    },
    {
      "level": 2,
      "title": "9. 자신만의 도구 체인을 구축하기 위한 훌륭한 도구 추천 목록이 있습니다.",
      "slug": "_9-자신만의-도구-체인을-구축하기-위한-훌륭한-도구-추천-목록이-있습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "10. 권장되는 편집기는 VS Code, WebStorm, Sublime Text 및 Vim입니다.",
      "slug": "_10-권장되는-편집기는-vs-code-webstorm-sublime-text-및-vim입니다",
      "children": []
    },
    {
      "level": 2,
      "title": "11. React를 올바르게 사용하려면 ESLint가 필요합니다.",
      "slug": "_11-react를-올바르게-사용하려면-eslint가-필요합니다",
      "children": []
    },
    {
      "level": 2,
      "title": "12. Prettier가 최고입니다.",
      "slug": "_12-prettier가-최고입니다",
      "children": []
    },
    {
      "level": 2,
      "title": "13. 사파리용 React Developer Tools 브라우저 확장 프로그램이 없습니다.",
      "slug": "_13-사파리용-react-developer-tools-브라우저-확장-프로그램이-없습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "14. React 앱은 컴포넌트로 이루어져 있습니다.",
      "slug": "_14-react-앱은-컴포넌트로-이루어져-있습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "15. 자바스크립트에 대해 배우려면 MDN과 javascript.info를 추천합니다.",
      "slug": "_15-자바스크립트에-대해-배우려면-mdn과-javascript-info를-추천합니다",
      "children": []
    },
    {
      "level": 2,
      "title": "16. 그들은 HTML을 JSX로 변환하는 온라인 도구를 추천합니다",
      "slug": "_16-그들은-html을-jsx로-변환하는-온라인-도구를-추천합니다",
      "children": []
    },
    {
      "level": 2,
      "title": "17. React에서 CSS를 추가하는 방법을 명시적으로 규정하지 않습니다.",
      "slug": "_17-react에서-css를-추가하는-방법을-명시적으로-규정하지-않습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "18. JSX에서 중괄호를 JavaScript로 “탈출구”로 생각할 수 있습니다.",
      "slug": "_18-jsx에서-중괄호를-javascript로-탈출구-로-생각할-수-있습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "19. JSX 내부에서 조건부 렌더링을 원한다면 ?와 && 연산자를 권장합니다.",
      "slug": "_19-jsx-내부에서-조건부-렌더링을-원한다면-와-연산자를-권장합니다",
      "children": []
    },
    {
      "level": 2,
      "title": "20. \"key\" 속성에 대한 명확한 설명이 제공됩니다.",
      "slug": "_20-key-속성에-대한-명확한-설명이-제공됩니다",
      "children": []
    },
    {
      "level": 2,
      "title": "21. 문서는 규칙과 관습을 설명하는 데 매우 좋습니다.",
      "slug": "_21-문서는-규칙과-관습을-설명하는-데-매우-좋습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "22. \"만약 조건문이나 반복문에서 후크를 사용하고 싶다면, 새로운 컴포넌트를 추출해서 거기에 넣어주세요.\"",
      "slug": "_22-만약-조건문이나-반복문에서-후크를-사용하고-싶다면-새로운-컴포넌트를-추출해서-거기에-넣어주세요",
      "children": []
    },
    {
      "level": 2,
      "title": "23. \"상태 끌어올리기\"가 중심에 있습니다.",
      "slug": "_23-상태-끌어올리기-가-중심에-있습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "24. UI 모작을 컴포넌트 계층구조로 변환하는 것은 창의적인 과정입니다.",
      "slug": "_24-ui-모작을-컴포넌트-계층구조로-변환하는-것은-창의적인-과정입니다",
      "children": []
    },
    {
      "level": 2,
      "title": "25. 상단 또는 하단에 위치해도 좋습니다.",
      "slug": "_25-상단-또는-하단에-위치해도-좋습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "26. 최소 상태가 멋져요.",
      "slug": "_26-최소-상태가-멋져요",
      "children": []
    },
    {
      "level": 2,
      "title": "27. Props와 State의 차이가 명확하게 설명되어 있습니다.",
      "slug": "_27-props와-state의-차이가-명확하게-설명되어-있습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "28. 공유 상태를 보유하는 데 전용 컴포넌트를 만드는 것은 괜찮습니다.",
      "slug": "_28-공유-상태를-보유하는-데-전용-컴포넌트를-만드는-것은-괜찮습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "29. Hooks라고 불리는 이유는 그들이 컴포넌트의 렌더링 주기에 \"후크되도록\" 허용하기 때문입니다.",
      "slug": "_29-hooks라고-불리는-이유는-그들이-컴포넌트의-렌더링-주기에-후크되도록-허용하기-때문입니다",
      "children": []
    },
    {
      "level": 2,
      "title": "30. 어느 면에서 React는 실제로 \"양방향 데이터 바인딩\"을 사용합니다.",
      "slug": "_30-어느-면에서-react는-실제로-양방향-데이터-바인딩-을-사용합니다",
      "children": []
    },
    {
      "level": 2,
      "title": "31. 문서에서는 컴포넌트 라이브러리 Chakra UI와 Material UI를 권장합니다.",
      "slug": "_31-문서에서는-컴포넌트-라이브러리-chakra-ui와-material-ui를-권장합니다",
      "children": []
    },
    {
      "level": 2,
      "title": "32. React는 \"상호작용 먼저\"라는 철학을 가지고 있어요.",
      "slug": "_32-react는-상호작용-먼저-라는-철학을-가지고-있어요",
      "children": []
    },
    {
      "level": 2,
      "title": "33. React에서 렌더링 로직과 마크업이 함께 존재합니다.",
      "slug": "_33-react에서-렌더링-로직과-마크업이-함께-존재합니다",
      "children": []
    },
    {
      "level": 2,
      "title": "34. React는 \"default vs named exports\" 논쟁에 중립을 취합니다.",
      "slug": "_34-react는-default-vs-named-exports-논쟁에-중립을-취합니다",
      "children": []
    },
    {
      "level": 2,
      "title": "35. 절대 다른 컴포넌트 내에 컴포넌트를 정의하지 마세요!",
      "slug": "_35-절대-다른-컴포넌트-내에-컴포넌트를-정의하지-마세요",
      "children": []
    },
    {
      "level": 2,
      "title": "36. 컴포넌트가 재사용되지 않더라도 만들어도 괜찮습니다.",
      "slug": "_36-컴포넌트가-재사용되지-않더라도-만들어도-괜찮습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "37. 프래그먼트를 사용하여 한 번에 하나 이상의 요소를 반환할 수 있습니다.",
      "slug": "_37-프래그먼트를-사용하여-한-번에-하나-이상의-요소를-반환할-수-있습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "38. aria-*와 data-*는 대시로 작성된 유일한 JSX 속성입니다.",
      "slug": "_38-aria-와-data-는-대시로-작성된-유일한-jsx-속성입니다",
      "children": []
    },
    {
      "level": 2,
      "title": "39. \"더블 컬리즈\"는 공식 용어에요.",
      "slug": "_39-더블-컬리즈-는-공식-용어에요",
      "children": []
    },
    {
      "level": 2,
      "title": "40. HTML 태그에 전달할 수 있는 속성들은 미리 정의되어 있습니다.",
      "slug": "_40-html-태그에-전달할-수-있는-속성들은-미리-정의되어-있습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "41. 계속해서 전개 연산자를 사용하면 도덕적으로 부적절한 행동을 할 수 있습니다.",
      "slug": "_41-계속해서-전개-연산자를-사용하면-도덕적으로-부적절한-행동을-할-수-있습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "42. 일부 구성 요소에는 \"채워질\" 수 있는 \"구멍\"이 있습니다.",
      "slug": "_42-일부-구성-요소에는-채워질-수-있는-구멍-이-있습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "43. 컴포넌트는 시간이 지남에 따라 다른 prop을 받을 수 있습니다.",
      "slug": "_43-컴포넌트는-시간이-지남에-따라-다른-prop을-받을-수-있습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "문서에서는 삼항 연산자를 \"적당히 사용\"하라고 권장합니다.",
      "slug": "문서에서는-삼항-연산자를-적당히-사용-하라고-권장합니다",
      "children": []
    },
    {
      "level": 2,
      "title": "45. && 연산자 왼쪽에 숫자를 놓지 마세요.",
      "slug": "_45-연산자-왼쪽에-숫자를-놓지-마세요",
      "children": []
    },
    {
      "level": 2,
      "title": "46. 때로는 단축키를 피하고 조건에 따라 JSX를 변수에 할당하는 것이 더 좋을 수도 있어요.",
      "slug": "_46-때로는-단축키를-피하고-조건에-따라-jsx를-변수에-할당하는-것이-더-좋을-수도-있어요",
      "children": [
        {
          "level": 3,
          "title": "47. 문서에서는 \"crypto.randomUUID()\" 또는 \"uuid\"와 같은 패키지를 추천합니다.",
          "slug": "_47-문서에서는-crypto-randomuuid-또는-uuid-와-같은-패키지를-추천합니다",
          "children": []
        }
      ]
    },
    {
      "level": 2,
      "title": "48. 컴포넌트에 키가 프롭으로 전달되지 않습니다.",
      "slug": "_48-컴포넌트에-키가-프롭으로-전달되지-않습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "49. React는 여러분이 작성하는 모든 컴포넌트가 순수 함수라고 가정합니다.",
      "slug": "_49-react는-여러분이-작성하는-모든-컴포넌트가-순수-함수라고-가정합니다",
      "children": []
    },
    {
      "level": 2,
      "title": "50. StrictMode로 불순한 계산 감지하기.",
      "slug": "_50-strictmode로-불순한-계산-감지하기",
      "children": []
    },
    {
      "level": 2,
      "title": "51. 모든 것이 React에서 순수하지 않아요 😉",
      "slug": "_51-모든-것이-react에서-순수하지-않아요",
      "children": []
    },
    {
      "level": 2,
      "title": "52. 디자인 시스템에 대한 미디엄 기사로 링크가 있어요.",
      "slug": "_52-디자인-시스템에-대한-미디엄-기사로-링크가-있어요",
      "children": []
    },
    {
      "level": 2,
      "title": "53. 이벤트 객체는 보통 관례적으로 \"e\"로 부르곤 해요.",
      "slug": "_53-이벤트-객체는-보통-관례적으로-e-로-부르곤-해요",
      "children": []
    },
    {
      "level": 2,
      "title": "54. 이벤트 핸들러는 그냥 props로 전달되는 함수일 뿐이에요.",
      "slug": "_54-이벤트-핸들러는-그냥-props로-전달되는-함수일-뿐이에요",
      "children": []
    },
    {
      "level": 2,
      "title": "55. 앱별 개념에 기반을 둔 이벤트 핸들러를 지어야 해요.",
      "slug": "_55-앱별-개념에-기반을-둔-이벤트-핸들러를-지어야-해요",
      "children": []
    },
    {
      "level": 2,
      "title": "56. 문서에서 캡처와 전파가 존재한다고 상기시킵니다.",
      "slug": "_56-문서에서-캡처와-전파가-존재한다고-상기시킵니다",
      "children": []
    },
    {
      "level": 2,
      "title": "57. e.stopPropagation()은 전파를 중단합니다.",
      "slug": "_57-e-stoppropagation-은-전파를-중단합니다",
      "children": [
        {
          "level": 3,
          "title": "58. e.preventDefault()는 기본 동작을 막습니다.",
          "slug": "_58-e-preventdefault-는-기본-동작을-막습니다",
          "children": []
        },
        {
          "level": 3,
          "title": "59. 로컬 변수는 렌더 사이에 유지되지 않습니다.",
          "slug": "_59-로컬-변수는-렌더-사이에-유지되지-않습니다",
          "children": []
        }
      ]
    },
    {
      "level": 2,
      "title": "60. 로컬 변수의 변경 사항은 렌더링을 트리거하지 않습니다.",
      "slug": "_60-로컬-변수의-변경-사항은-렌더링을-트리거하지-않습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "61. 컴포넌트를 새 데이터로 업데이트하려면 두 가지가 필요합니다.",
      "slug": "_61-컴포넌트를-새-데이터로-업데이트하려면-두-가지가-필요합니다",
      "children": []
    },
    {
      "level": 2,
      "title": "62. 화면에 있는 각 구성 요소 인스턴스에 대해 상태는 개인적이에요.",
      "slug": "_62-화면에-있는-각-구성-요소-인스턴스에-대해-상태는-개인적이에요",
      "children": []
    },
    {
      "level": 2,
      "title": "63. 트리거, 렌더링, 그리고 커밋.",
      "slug": "_63-트리거-렌더링-그리고-커밋",
      "children": []
    },
    {
      "level": 2,
      "title": "63. 컴포넌트가 렌더링되는 두 가지 이유가 있다.",
      "slug": "_63-컴포넌트가-렌더링되는-두-가지-이유가-있다",
      "children": []
    },
    {
      "level": 2,
      "title": "64. 성능을 향상시키는 방법이 있지만 조심스럽게 처리하세요.",
      "slug": "_64-성능을-향상시키는-방법이-있지만-조심스럽게-처리하세요",
      "children": []
    },
    {
      "level": 2,
      "title": "65. 리액트는 똑똑해요. 혹시 당신보다 더 똑똑할 수도 있어요!",
      "slug": "_65-리액트는-똑똑해요-혹시-당신보다-더-똑똑할-수도-있어요",
      "children": []
    },
    {
      "level": 2,
      "title": "66. React는 렌더링 사이에 차이가 있을 때에만 DOM 노드를 변경합니다.",
      "slug": "_66-react는-렌더링-사이에-차이가-있을-때에만-dom-노드를-변경합니다",
      "children": []
    },
    {
      "level": 2,
      "title": "67. State는 시간의 UI 스냅샷과 같습니다.",
      "slug": "_67-state는-시간의-ui-스냅샷과-같습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "68. 렌더링 내에서 상태 변수의 값은 결코 변경되지 않습니다.",
      "slug": "_68-렌더링-내에서-상태-변수의-값은-결코-변경되지-않습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "69. React는 상태 업데이트를 일괄 처리해요.",
      "slug": "_69-react는-상태-업데이트를-일괄-처리해요",
      "children": []
    },
    {
      "level": 2,
      "title": "70. 비동기 이벤트 핸들러의 경우, \"async\" 부분은 미래의 일괄 작업에서 실행될 수 있습니다.",
      "slug": "_70-비동기-이벤트-핸들러의-경우-async-부분은-미래의-일괄-작업에서-실행될-수-있습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "71. \"업데이터 함수\"를 사용하면 이벤트 핸들러에서 동일한 상태를 여러 번 설정할 수 있습니다.",
      "slug": "_71-업데이터-함수-를-사용하면-이벤트-핸들러에서-동일한-상태를-여러-번-설정할-수-있습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "72. '업데이터 함수'는 순수해야 합니다.",
      "slug": "_72-업데이터-함수-는-순수해야-합니다",
      "children": []
    },
    {
      "level": 2,
      "title": "73. 문서에서는 업데이터 함수에 대해 명명 규칙을 추천하고 있어.",
      "slug": "_73-문서에서는-업데이터-함수에-대해-명명-규칙을-추천하고-있어",
      "children": []
    },
    {
      "level": 2,
      "title": "74. 일괄 상태 업데이트는 내부적으로 간단한 큐로 구현됩니다.",
      "slug": "_74-일괄-상태-업데이트는-내부적으로-간단한-큐로-구현됩니다",
      "children": []
    },
    {
      "level": 2,
      "title": "75. 상태는 읽기 전용으로 취급하세요.",
      "slug": "_75-상태는-읽기-전용으로-취급하세요",
      "children": []
    },
    {
      "level": 2,
      "title": "77. 상태에서 중첩된 객체에 주의하세요.",
      "slug": "_77-상태에서-중첩된-객체에-주의하세요",
      "children": []
    },
    {
      "level": 2,
      "title": "78. 자바스크립트에서 객체는 \"실제로\" 중첩되지 않습니다.",
      "slug": "_78-자바스크립트에서-객체는-실제로-중첩되지-않습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "79. 만약 퍼뜨리기를 싫어한다면 문서는 Immer를 추천합니다.",
      "slug": "_79-만약-퍼뜨리기를-싫어한다면-문서는-immer를-추천합니다",
      "children": []
    },
    {
      "level": 2,
      "title": "80. 상태 안의 배열도 읽기 전용으로 취급하십시오.",
      "slug": "_80-상태-안의-배열도-읽기-전용으로-취급하십시오",
      "children": []
    },
    {
      "level": 2,
      "title": "81. 문서에는 상태의 배열에서 피해야 할 메서드를 나열한 표가 제공됩니다.",
      "slug": "_81-문서에는-상태의-배열에서-피해야-할-메서드를-나열한-표가-제공됩니다",
      "children": []
    },
    {
      "level": 2,
      "title": "82. 문서에서 배열이 객체를 포함할 수 있다는 것을 상기하라.",
      "slug": "_82-문서에서-배열이-객체를-포함할-수-있다는-것을-상기하라",
      "children": []
    },
    {
      "level": 2,
      "title": "83. 상태 관리 시 디자이너처럼 생각해보세요.",
      "slug": "_83-상태-관리-시-디자이너처럼-생각해보세요",
      "children": []
    },
    {
      "level": 2,
      "title": "84. 선언적 논리는 명령형 논리보다 더 많은 코드 줄을 사용할 수 있습니다.",
      "slug": "_84-선언적-논리는-명령형-논리보다-더-많은-코드-줄을-사용할-수-있습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "85. 문서에서는 Storybook과 같은 도구의 유용성에 대해 다룹니다.",
      "slug": "_85-문서에서는-storybook과-같은-도구의-유용성에-대해-다룹니다",
      "children": []
    },
    {
      "level": 2,
      "title": "86. 관련된 상태를 그룹화하세요.",
      "slug": "_86-관련된-상태를-그룹화하세요",
      "children": []
    },
    {
      "level": 2,
      "title": "87. 상태에서 모순을 피하세요.",
      "slug": "_87-상태에서-모순을-피하세요",
      "children": []
    },
    {
      "level": 2,
      "title": "88. 상태에서 props를 반대로 미러링하지 마세요.",
      "slug": "_88-상태에서-props를-반대로-미러링하지-마세요",
      "children": []
    },
    {
      "level": 2,
      "title": "89. 중첩된 상태를 피하세요.",
      "slug": "_89-중첩된-상태를-피하세요",
      "children": []
    },
    {
      "level": 2,
      "title": "90. 데이터가 깊게 중첩된 상태를 피하라 — 추가 팁!",
      "slug": "_90-데이터가-깊게-중첩된-상태를-피하라-—-추가-팁",
      "children": []
    },
    {
      "level": 2,
      "title": "91. \"제어 컴포넌트 vs 비제어 컴포넌트\"가 명확하게 설명되어 있습니다.",
      "slug": "_91-제어-컴포넌트-vs-비제어-컴포넌트-가-명확하게-설명되어-있습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "92. CSSOM이라는 것이 있습니다.",
      "slug": "_92-cssom이라는-것이-있습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "93. React에는 내부 \"UI 트리\"가 있습니다.",
      "slug": "_93-react에는-내부-ui-트리-가-있습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "94. 상태는 UI 트리 내의 위치에 바인딩됩니다.",
      "slug": "_94-상태는-ui-트리-내의-위치에-바인딩됩니다",
      "children": []
    },
    {
      "level": 2,
      "title": "96. 같은 위치에서 상태를 재설정하는 방법: 기틀을 이루다.",
      "slug": "_96-같은-위치에서-상태를-재설정하는-방법-기틀을-이루다",
      "children": []
    },
    {
      "level": 2,
      "title": "97. 같은 위치에서 상태 재설정: 차드 방식.",
      "slug": "_97-같은-위치에서-상태-재설정-차드-방식",
      "children": []
    },
    {
      "level": 2,
      "title": "98. 이전 상태로 되돌리고 싶다면 어떻게 해야 할까요?",
      "slug": "_98-이전-상태로-되돌리고-싶다면-어떻게-해야-할까요",
      "children": []
    },
    {
      "level": 2,
      "title": "99. React™️에서 가장 추한 패턴 — 렌더링에 대한 상태 조정.",
      "slug": "_99-reacttm️에서-가장-추한-패턴-—-렌더링에-대한-상태-조정",
      "children": []
    },
    {
      "level": 2,
      "title": "100. 때때로 리듀서는 복잡한 상태를 모델링하는 데 도움이 될 수 있습니다.",
      "slug": "_100-때때로-리듀서는-복잡한-상태를-모델링하는-데-도움이-될-수-있습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "101. 각 reducer 액션은 단일 사용자 상호작용을 설명해야 합니다.",
      "slug": "_101-각-reducer-액션은-단일-사용자-상호작용을-설명해야-합니다",
      "children": []
    },
    {
      "level": 2,
      "title": "102. 리듀서 액션 객체 규칙.",
      "slug": "_102-리듀서-액션-객체-규칙",
      "children": []
    },
    {
      "level": 2,
      "title": "103. 컴포넌트 외부에 리듀서를 위치시키세요.",
      "slug": "_103-컴포넌트-외부에-리듀서를-위치시키세요",
      "children": []
    },
    {
      "level": 2,
      "title": "104. 리듀서에서 \"switch\" 문을 사용하는 것이 관례입니다.",
      "slug": "_104-리듀서에서-switch-문을-사용하는-것이-관례입니다",
      "children": []
    },
    {
      "level": 2,
      "title": "105. 리듀서가 왜 리듀서라고 불리는지에 대한 만족스러운 설명은 없어요.",
      "slug": "_105-리듀서가-왜-리듀서라고-불리는지에-대한-만족스러운-설명은-없어요",
      "children": []
    },
    {
      "level": 2,
      "title": "106. Reducers를 사용하는 건 개인적인 취향의 문제에요.",
      "slug": "_106-reducers를-사용하는-건-개인적인-취향의-문제에요",
      "children": []
    },
    {
      "level": 2,
      "title": "107. 리듀서는 순수해야 합니다.",
      "slug": "_107-리듀서는-순수해야-합니다",
      "children": []
    },
    {
      "level": 2,
      "title": "108. 컨텍스트를 사용하면 \"prop drilling\"을 거치지 않고 정보를 전달할 수 있습니다.",
      "slug": "_108-컨텍스트를-사용하면-prop-drilling-을-거치지-않고-정보를-전달할-수-있습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "109. 컨텍스트는 초급자도 쉬워요!",
      "slug": "_109-컨텍스트는-초급자도-쉬워요",
      "children": []
    },
    {
      "level": 2,
      "title": "110. 가장 가까운 프로바이더로부터 값을 가져올 수 있는 컨텍스트를 사용하는 자녀입니다.",
      "slug": "_110-가장-가까운-프로바이더로부터-값을-가져올-수-있는-컨텍스트를-사용하는-자녀입니다",
      "children": []
    },
    {
      "level": 2,
      "title": "111. 동일한 컴포넌트에서 동일한 컨텍스트를 사용하고 제공할 수 있습니다.",
      "slug": "_111-동일한-컴포넌트에서-동일한-컨텍스트를-사용하고-제공할-수-있습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "112. 컨텍스트를 CSS 속성 상속으로 생각할 수 있어요.",
      "slug": "_112-컨텍스트를-css-속성-상속으로-생각할-수-있어요",
      "children": []
    },
    {
      "level": 2,
      "title": "113. 컨텍스트 남용 금지!",
      "slug": "_113-컨텍스트-남용-금지",
      "children": []
    },
    {
      "level": 2,
      "title": "114. 문서에는 문맥(context)의 일반적인 사용 사례가 나와 있어요.",
      "slug": "_114-문서에는-문맥-context-의-일반적인-사용-사례가-나와-있어요",
      "children": []
    },
    {
      "level": 2,
      "title": "115. 기억하세요, 문맥은 정적 값에만 해당하는 것이 아닙니다.",
      "slug": "_115-기억하세요-문맥은-정적-값에만-해당하는-것이-아닙니다",
      "children": []
    },
    {
      "level": 2,
      "title": "116. 컨텍스트 + 리듀서 = 체드 개발자.",
      "slug": "_116-컨텍스트-리듀서-체드-개발자",
      "children": []
    },
    {
      "level": 2,
      "title": "117. 더 많은 Chad: 리듀서에 두 가지 컨텍스트를 가지세요.",
      "slug": "_117-더-많은-chad-리듀서에-두-가지-컨텍스트를-가지세요",
      "children": []
    },
    {
      "level": 2,
      "title": "118. 기가 차드: 컨텍스트를 위한 사용자 정의 훅 만들기",
      "slug": "_118-기가-차드-컨텍스트를-위한-사용자-정의-훅-만들기",
      "children": []
    },
    {
      "level": 2,
      "title": "119. Refs를 \"비밀 주머니\"로 생각해보세요.",
      "slug": "_119-refs를-비밀-주머니-로-생각해보세요",
      "children": []
    },
    {
      "level": 2,
      "title": "120. refs를 사용하는 시점.",
      "slug": "_120-refs를-사용하는-시점",
      "children": []
    },
    {
      "level": 2,
      "title": "121. 렌더링 중에 ref.current 값을 읽거나 쓰지 말아야 합니다.",
      "slug": "_121-렌더링-중에-ref-current-값을-읽거나-쓰지-말아야-합니다",
      "children": []
    },
    {
      "level": 2,
      "title": "122. 같은 컴포넌트에서 ref와 상태를 결합할 수 있습니다.",
      "slug": "_122-같은-컴포넌트에서-ref와-상태를-결합할-수-있습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "123. useRef가 내부에서 어떻게 작동합니까?",
      "slug": "_123-useref가-내부에서-어떻게-작동합니까",
      "children": []
    },
    {
      "level": 2,
      "title": "124. ref.current를 변경하면 즉시 변경됩니다.",
      "slug": "_124-ref-current를-변경하면-즉시-변경됩니다",
      "children": []
    },
    {
      "level": 2,
      "title": "125. 컴포넌트 외부의 변수 대신 ref를 사용해보는 것은 어떨까요?",
      "slug": "_125-컴포넌트-외부의-변수-대신-ref를-사용해보는-것은-어떨까요",
      "children": []
    },
    {
      "level": 2,
      "title": "126. Ref는 비동기 작업으로부터 최신 상태를 읽는 데 도움을 줍니다.",
      "slug": "_126-ref는-비동기-작업으로부터-최신-상태를-읽는-데-도움을-줍니다",
      "children": []
    },
    {
      "level": 2,
      "title": "127. React는 DOM에서 손을 떼도록 요청합니다.",
      "slug": "_127-react는-dom에서-손을-떼도록-요청합니다",
      "children": []
    },
    {
      "level": 2,
      "title": "128. 실제로 DOM 노드가 필요한 경우 ref를 사용하세요.",
      "slug": "_128-실제로-dom-노드가-필요한-경우-ref를-사용하세요",
      "children": []
    },
    {
      "level": 2,
      "title": "129. DOM 노드 참조의 알 수없는 수량을 관리하는 방법은?",
      "slug": "_129-dom-노드-참조의-알-수없는-수량을-관리하는-방법은",
      "children": []
    },
    {
      "level": 2,
      "title": "130. 다른 컴포넌트의 DOM 노드에 액세스하려면 'forwardRef'를 사용하십시오.",
      "slug": "_130-다른-컴포넌트의-dom-노드에-액세스하려면-forwardref-를-사용하십시오",
      "children": []
    },
    {
      "level": 2,
      "title": "131. ‘forwardRef’를 사용하여 여러 DOM 노드 refs를 전달할 수 있을까요?",
      "slug": "_131-forwardref-를-사용하여-여러-dom-노드-refs를-전달할-수-있을까요",
      "children": []
    },
    {
      "level": 2,
      "title": "132. 'useImperativeHandle'를 사용하면 'forwardRef'로 노출할 기능을 제어할 수 있어요.",
      "slug": "_132-useimperativehandle-를-사용하면-forwardref-로-노출할-기능을-제어할-수-있어요",
      "children": []
    },
    {
      "level": 2,
      "title": "133. 리액트에서 관리되는 DOM 노드를 변경하지 마세요.",
      "slug": "_133-리액트에서-관리되는-dom-노드를-변경하지-마세요",
      "children": []
    },
    {
      "level": 2,
      "title": "134. 효과는 문서에서 소개된 두 번째-to-last 개념입니다.",
      "slug": "_134-효과는-문서에서-소개된-두-번째-to-last-개념입니다",
      "children": []
    },
    {
      "level": 2,
      "title": "135. \"효과\"와 \"부작용\"에는 차이가 있습니다.",
      "slug": "_135-효과-와-부작용-에는-차이가-있습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "136. 효과는 렌더링에 의해 발생하는 부수 효과입니다. 사용자 조작이 아닙니다.",
      "slug": "_136-효과는-렌더링에-의해-발생하는-부수-효과입니다-사용자-조작이-아닙니다",
      "children": []
    },
    {
      "level": 2,
      "title": "137. 컴포넌트에 효과를 빠르게 추가하지 마세요.",
      "slug": "_137-컴포넌트에-효과를-빠르게-추가하지-마세요",
      "children": []
    },
    {
      "level": 2,
      "title": "138. 효과(Effects)는 컴포넌트와 외부 시스템을 동기화하는 데 사용됩니다.",
      "slug": "_138-효과-effects-는-컴포넌트와-외부-시스템을-동기화하는-데-사용됩니다",
      "children": []
    },
    {
      "level": 2,
      "title": "139. Effects run after rendering.",
      "slug": "_139-effects-run-after-rendering",
      "children": []
    },
    {
      "level": 2,
      "title": "140. Effect를 작성하는 방법.",
      "slug": "_140-effect를-작성하는-방법",
      "children": []
    },
    {
      "level": 2,
      "title": "141. 의존성을 선언하지 않는 한 효과는 모든 렌더링 후에 실행됩니다.",
      "slug": "_141-의존성을-선언하지-않는-한-효과는-모든-렌더링-후에-실행됩니다",
      "children": []
    },
    {
      "level": 2,
      "title": "142. 리액트에서는 의존성이 당신을 선택합니다.",
      "slug": "_142-리액트에서는-의존성이-당신을-선택합니다",
      "children": []
    },
    {
      "level": 2,
      "title": "143. 의존성 배열 유무에 따른 다른 동작",
      "slug": "_143-의존성-배열-유무에-따른-다른-동작",
      "children": []
    },
    {
      "level": 2,
      "title": "144. 의존성 배열에는 참조와 set 함수가 제외됩니다.",
      "slug": "_144-의존성-배열에는-참조와-set-함수가-제외됩니다",
      "children": []
    },
    {
      "level": 2,
      "title": "145. 필요한 경우 정리 추가하기",
      "slug": "_145-필요한-경우-정리-추가하기",
      "children": []
    },
    {
      "level": 2,
      "title": "146. 개발 환경에서 Effects가 두 번 실행됩니다.",
      "slug": "_146-개발-환경에서-effects가-두-번-실행됩니다",
      "children": []
    },
    {
      "level": 2,
      "title": "147. 애니메이션을 정리하는 방법은 무엇인가요?",
      "slug": "_147-애니메이션을-정리하는-방법은-무엇인가요",
      "children": []
    },
    {
      "level": 2,
      "title": "147. 데이터를 가져오는 효과를 정리하는 방법",
      "slug": "_147-데이터를-가져오는-효과를-정리하는-방법",
      "children": []
    },
    {
      "level": 2,
      "title": "147. 라이브러리를 만들지 않는 한, Effects에서 데이터를 가져오지 마세요.",
      "slug": "_147-라이브러리를-만들지-않는-한-effects에서-데이터를-가져오지-마세요",
      "children": []
    },
    {
      "level": 2,
      "title": "148. 제품 구매는 효과가 아닙니다.",
      "slug": "_148-제품-구매는-효과가-아닙니다",
      "children": []
    },
    {
      "level": 2,
      "title": "149. 각 렌더는 자체 Effects를 갖습니다.",
      "slug": "_149-각-렌더는-자체-effects를-갖습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "150. 비싼 계산을 캐시하기 위해 이펙트가 필요하지 않습니다.",
      "slug": "_150-비싼-계산을-캐시하기-위해-이펙트가-필요하지-않습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "151. 효과 체인을 피하세요.",
      "slug": "_151-효과-체인을-피하세요",
      "children": []
    },
    {
      "level": 2,
      "title": "152. 애플리케이션을 이펙트로 초기화할 때 조심하세요.",
      "slug": "_152-애플리케이션을-이펙트로-초기화할-때-조심하세요",
      "children": []
    },
    {
      "level": 2,
      "title": "153. 외부 시스템이 \"store\"라면 useSyncExternalStore를 사용해보세요.",
      "slug": "_153-외부-시스템이-store-라면-usesyncexternalstore를-사용해보세요",
      "children": []
    },
    {
      "level": 2,
      "title": "154. 효과의 라이프사이클은 컴포넌트의 라이프사이클과 다릅니다.",
      "slug": "_154-효과의-라이프사이클은-컴포넌트의-라이프사이클과-다릅니다",
      "children": []
    },
    {
      "level": 2,
      "title": "155. 각 효과는 별도의 동기화 프로세스를 나타냅니다.",
      "slug": "_155-각-효과는-별도의-동기화-프로세스를-나타냅니다",
      "children": []
    },
    {
      "level": 2,
      "title": "156. 반응 값: 의존성을 바라보는 또 다른 방법.",
      "slug": "_156-반응-값-의존성을-바라보는-또-다른-방법",
      "children": []
    },
    {
      "level": 2,
      "title": "157. 가변 값(전역 변수 포함)은 종속성이 될 수 없습니다.",
      "slug": "_157-가변-값-전역-변수-포함-은-종속성이-될-수-없습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "158. 동기화를 원치 않을 때 어떻게 해야 할까요?",
      "slug": "_158-동기화를-원치-않을-때-어떻게-해야-할까요",
      "children": []
    },
    {
      "level": 2,
      "title": "159. 린터를 무시하지 마세요.",
      "slug": "_159-린터를-무시하지-마세요",
      "children": []
    },
    {
      "level": 2,
      "title": "160. React의 궁극적인 무기: useEffectEvent",
      "slug": "_160-react의-궁극적인-무기-useeffectevent",
      "children": []
    }
  ],
  "git": {
    "updatedTime": 1713854865000
  },
  "filePathRelative": "docs/Nextjs/2024-04-05-ReactJSBestPracticesFromTheNewDocs/README.md"
}

if (import.meta.webpackHot) {
  import.meta.webpackHot.accept()
  if (__VUE_HMR_RUNTIME__.updatePageData) {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  }
}

if (import.meta.hot) {
  import.meta.hot.accept(({ data }) => {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  })
}
