<template><div><p>개발 중에 컴포넌트 스토리를 작성할 때, 나중에 다시 방문할 수 있는 기본 문서도 함께 만들어요.</p>
<p>Storybook은 이 중요한 문서를 확장할 수 있는 도구를 제공해요. 여기에는 구성 요소와 스토리를 주요하게 보여주는 글과 레이아웃이 포함돼요. 이를 통해 UI 라이브러리 사용 가이드라인, 디자인 시스템 사이트 등도 만들 수 있어요.</p>
<p><img src="@source/docs/Tech/2024-04-07-Howtodocumentcomponents/img/Howtodocumentcomponents_0.png" alt="이미지"></p>
<p>프로젝트에 Storybook을 처음으로 포함하는 경우, 문서 페이지(&quot;Autodocs&quot;로 짧게 줄여요)를 제공해요. 이 페이지는 스토리 옆에 위치하여 기존 스토리와 관련 메타데이터를 자동으로 생성한 베이스라인 템플릿이에요.</p>
<p>또한, 사용 가능한 템플릿을 필요에 따라 사용자 정의하거나 각 구성 요소에 대해 MDX를 사용하여 자유 형식 페이지를 만들 수도 있습니다. 두 경우 모두 완벽한 기능을 갖춘 문서를 작성하기 위해 빌딩 블록으로 Doc Blocks을 사용할 것입니다.</p>
<p>대부분의 경우에서 Docs는 기본 설정으로 작동하도록 자동으로 구성됩니다. 특정 경우에는 구성을 조정해야 할 수도 있습니다. 관련 내용은 여기에서 자세히 읽을 수 있습니다.</p>
</div></template>
