export const data = {
  "key": "v-f27aa742",
  "path": "/docs/Tech/2024-03-28-4useStateMistakesYouShouldAvoidinReact/",
  "title": "리액트에서 피해야 할 4가지 useState 실수🚫",
  "lang": "ko",
  "frontmatter": {
    "title": "리액트에서 피해야 할 4가지 useState 실수🚫",
    "description": "",
    "date": "2024-03-28 18:31",
    "sidebarDepth": 0,
    "tag": "Tech",
    "thumbnail": null,
    "originalTitle": "4 useState Mistakes You Should Avoid in React🚫",
    "link": "https://medium.com/gitconnected/4-usestate-mistakes-you-should-avoid-in-react-0d9d676869e2"
  },
  "excerpt": "",
  "headers": [
    {
      "level": 2,
      "title": "소개",
      "slug": "소개",
      "children": [
        {
          "level": 3,
          "title": "실수 1: 이전 상태를 고려하지 않는 것 😨",
          "slug": "실수-1-이전-상태를-고려하지-않는-것-😨",
          "children": []
        },
        {
          "level": 3,
          "title": "❌ 이슈를 이해하기",
          "slug": "❌-이슈를-이해하기",
          "children": []
        }
      ]
    },
    {
      "level": 2,
      "title": "✅ 수정 방법:",
      "slug": "✅-수정-방법",
      "children": []
    },
    {
      "level": 2,
      "title": "실수 2: 상태 불변성을 방치하기 🧊",
      "slug": "실수-2-상태-불변성을-방치하기-🧊",
      "children": []
    },
    {
      "level": 2,
      "title": "❌ 문제 이해하기",
      "slug": "❌-문제-이해하기",
      "children": []
    },
    {
      "level": 2,
      "title": "실수 3: 비동기 업데이트 오해 ⏳",
      "slug": "실수-3-비동기-업데이트-오해-⏳",
      "children": []
    },
    {
      "level": 2,
      "title": "❌ 문제 이해하기",
      "slug": "❌-문제-이해하기-1",
      "children": []
    },
    {
      "level": 2,
      "title": "✅ 수정 방법:",
      "slug": "✅-수정-방법-1",
      "children": []
    },
    {
      "level": 2,
      "title": "실수 4: 파생 데이터에 상태를 오용하기 📊",
      "slug": "실수-4-파생-데이터에-상태를-오용하기-📊",
      "children": []
    },
    {
      "level": 2,
      "title": "❌ 이해해야 할 사항",
      "slug": "❌-이해해야-할-사항",
      "children": []
    },
    {
      "level": 2,
      "title": "✅ 수정 내용:",
      "slug": "✅-수정-내용",
      "children": []
    },
    {
      "level": 2,
      "title": "결론 🚀",
      "slug": "결론-🚀",
      "children": []
    }
  ],
  "git": {
    "updatedTime": 1711677261000
  },
  "filePathRelative": "docs/Tech/2024-03-28-4useStateMistakesYouShouldAvoidinReact/README.md"
}
