export const data = {
  "key": "v-43059615",
  "path": "/docs/Tech/2024-04-19-15Game-ChangingWebsitestoRevolutionizeYourDesignExperience/",
  "title": "디자인 경험을 공부하기 좋은 15가지 웹사이트!",
  "lang": "ko",
  "frontmatter": {
    "title": "디자인 경험을 공부하기 좋은 15가지 웹사이트!",
    "description": "",
    "date": "2024-04-19 23:11",
    "sidebarDepth": 0,
    "tag": "Tech",
    "thumbnail": null,
    "originalTitle": "15 Game-Changing Websites to Revolutionize Your Design Experience!",
    "link": "https://medium.com/@ranisa-gupta/15-game-changing-websites-to-revolutionize-your-design-experience-16fd5fa16efa"
  },
  "excerpt": "",
  "headers": [
    {
      "level": 2,
      "title": "🔼 커스터마이즈 가능한 스타일로 버튼 디자인을 간단하게 만들어보세요. 귀찮은 버튼 작성 작업과 이별하세요!",
      "slug": "🔼-커스터마이즈-가능한-스타일로-버튼-디자인을-간단하게-만들어보세요-귀찮은-버튼-작성-작업과-이별하세요",
      "children": []
    },
    {
      "level": 2,
      "title": "🔼 물리적 물체를 흉내 내는 뉴모피즘 요소로 UI를 높여보세요. 세련된 현대적인 외관을 위한 준비된 CSS 코드를 받아보세요.",
      "slug": "🔼-물리적-물체를-흉내-내는-뉴모피즘-요소로-ui를-높여보세요-세련된-현대적인-외관을-위한-준비된-css-코드를-받아보세요",
      "children": []
    },
    {
      "level": 2,
      "title": "🔼 스트라이프 배경으로 디자인에 깊이를 더하세요. 시각적 매력을 간편하게 향상시킵니다!",
      "slug": "🔼-스트라이프-배경으로-디자인에-깊이를-더하세요-시각적-매력을-간편하게-향상시킵니다",
      "children": []
    },
    {
      "level": 2,
      "title": "🔼 방대한 무료 폰트 컬렉션으로 타이포그래피 영역을 확장해보세요. 프로젝트에 매끄럽게 통합하여 세련된 마무리를 만들어보세요.",
      "slug": "🔼-방대한-무료-폰트-컬렉션으로-타이포그래피-영역을-확장해보세요-프로젝트에-매끄럽게-통합하여-세련된-마무리를-만들어보세요",
      "children": []
    },
    {
      "level": 2,
      "title": "🔼 멋진 SVG 패턴으로 창의력의 파도를 타보세요. 쉽게 웹사이트에 활력을 불어넣어보세요.",
      "slug": "🔼-멋진-svg-패턴으로-창의력의-파도를-타보세요-쉽게-웹사이트에-활력을-불어넣어보세요",
      "children": []
    },
    {
      "level": 2,
      "title": "🔼 브라우저 호환성 문제를 앞서 나아가 보세요. 플랫폼 간에 CSS가 원활하게 작동하는지 확인하기 위해 실시간 지원 테이블을 확인하세요.",
      "slug": "🔼-브라우저-호환성-문제를-앞서-나아가-보세요-플랫폼-간에-css가-원활하게-작동하는지-확인하기-위해-실시간-지원-테이블을-확인하세요",
      "children": []
    },
    {
      "level": 2,
      "title": "🔼 손쉽게 완벽한 팔레트를 찾으세요. 웹사이트를 시각적으로 멋지게 만들기 위해 다양한 색상의 세계를 탐험해보세요.",
      "slug": "🔼-손쉽게-완벽한-팔레트를-찾으세요-웹사이트를-시각적으로-멋지게-만들기-위해-다양한-색상의-세계를-탐험해보세요",
      "children": []
    },
    {
      "level": 2,
      "title": "🔼 복잡한 레이아웃을 쉽게 마스터하세요. 내용물을 매끄럽게 정리하기 위한 CSS 그리드를 생성하세요.",
      "slug": "🔼-복잡한-레이아웃을-쉽게-마스터하세요-내용물을-매끄럽게-정리하기-위한-css-그리드를-생성하세요",
      "children": []
    },
    {
      "level": 2,
      "title": "🔼 BEM 네이밍 규칙을 활용하여 코딩을 간편하게 만들어보세요. 더 깔끔하고 효율적인 CSS를 위한 빠른 참고서를 제공합니다.",
      "slug": "🔼-bem-네이밍-규칙을-활용하여-코딩을-간편하게-만들어보세요-더-깔끔하고-효율적인-css를-위한-빠른-참고서를-제공합니다",
      "children": []
    },
    {
      "level": 2,
      "title": "🔼 맞춤형 SVG 블롭으로 창의력을 펼쳐보세요. 독특한 모양으로 배경과 삽화를 향상시킵니다.",
      "slug": "🔼-맞춤형-svg-블롭으로-창의력을-펼쳐보세요-독특한-모양으로-배경과-삽화를-향상시킵니다",
      "children": []
    },
    {
      "level": 2,
      "title": "🔼 아름다운 그라데이션을 손쉽게 만들어보세요. 멋진 색상 전환을 위한 즉시 CSS 코드입니다.",
      "slug": "🔼-아름다운-그라데이션을-손쉽게-만들어보세요-멋진-색상-전환을-위한-즉시-css-코드입니다",
      "children": []
    },
    {
      "level": 2,
      "title": "🔼 Bring your website to life with ready-to-use animations. Engage visitors with dynamic elements.",
      "slug": "🔼-bring-your-website-to-life-with-ready-to-use-animations-engage-visitors-with-dynamic-elements",
      "children": []
    },
    {
      "level": 2,
      "title": "🔼 트렌디한 퍼스트 글래스 효과를 손쉽게 구현하세요. 멋진 UI 요소를 위해 투명도, 흐림 및 색상을 사용자 정의하세요.",
      "slug": "🔼-트렌디한-퍼스트-글래스-효과를-손쉽게-구현하세요-멋진-ui-요소를-위해-투명도-흐림-및-색상을-사용자-정의하세요",
      "children": []
    },
    {
      "level": 2,
      "title": "🔼 디자인을 정밀하게 다듬어보세요. CSS clip-path로 손쉽게 복잡한 모양을 만드세요.",
      "slug": "🔼-디자인을-정밀하게-다듬어보세요-css-clip-path로-손쉽게-복잡한-모양을-만드세요",
      "children": []
    },
    {
      "level": 2,
      "title": "웹 표준을 완벽하게 충족하는 CSS를 확인하세요. 코드를 유효성 검사하여 원활한 사용자 경험을 유지하세요.",
      "slug": "웹-표준을-완벽하게-충족하는-css를-확인하세요-코드를-유효성-검사하여-원활한-사용자-경험을-유지하세요",
      "children": []
    }
  ],
  "git": {
    "updatedTime": 1713854865000
  },
  "filePathRelative": "docs/Tech/2024-04-19-15Game-ChangingWebsitestoRevolutionizeYourDesignExperience/README.md"
}

if (import.meta.webpackHot) {
  import.meta.webpackHot.accept()
  if (__VUE_HMR_RUNTIME__.updatePageData) {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  }
}

if (import.meta.hot) {
  import.meta.hot.accept(({ data }) => {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  })
}
