export const data = {
  "key": "v-10212540",
  "path": "/docs/Tech/2024-04-19-12ProjectstoBuildtoImproveYourCodingSkills/",
  "title": "코딩 실력 향상을 위해 만들어 볼 수 있는 12가지 사이드 프로젝트 주제",
  "lang": "ko",
  "frontmatter": {
    "title": "코딩 실력 향상을 위해 만들어 볼 수 있는 12가지 사이드 프로젝트 주제",
    "description": "",
    "date": "2024-04-19 20:45",
    "sidebarDepth": 0,
    "tag": "Tech",
    "thumbnail": null,
    "originalTitle": "12 Projects to Build to Improve Your Coding Skills 👨‍💻👩‍💻",
    "link": "https://medium.com/stackademic/12-projects-to-build-to-improve-your-coding-skills-3e6a45b85ace"
  },
  "excerpt": "",
  "headers": [
    {
      "level": 2,
      "title": "1. 대시보드 패널",
      "slug": "_1-대시보드-패널",
      "children": []
    },
    {
      "level": 2,
      "title": "➡️ 이 프로젝트 만들기",
      "slug": "➡️-이-프로젝트-만들기",
      "children": []
    },
    {
      "level": 2,
      "title": "2. 블로그 앱",
      "slug": "_2-블로그-앱",
      "children": []
    },
    {
      "level": 2,
      "title": "➡️ 이 프로젝트 만들기",
      "slug": "➡️-이-프로젝트-만들기-1",
      "children": []
    },
    {
      "level": 2,
      "title": "3. 포켓몬 도감",
      "slug": "_3-포켓몬-도감",
      "children": []
    },
    {
      "level": 2,
      "title": "➡️ 이 프로젝트 만들기",
      "slug": "➡️-이-프로젝트-만들기-2",
      "children": []
    },
    {
      "level": 2,
      "title": "4. 할 일 관리 앱",
      "slug": "_4-할-일-관리-앱",
      "children": []
    },
    {
      "level": 2,
      "title": "➡️ 이 프로젝트 만들기",
      "slug": "➡️-이-프로젝트-만들기-3",
      "children": []
    },
    {
      "level": 2,
      "title": "5. 틱택토",
      "slug": "_5-틱택토",
      "children": []
    },
    {
      "level": 2,
      "title": "➡️ 이 프로젝트 만들기",
      "slug": "➡️-이-프로젝트-만들기-4",
      "children": []
    },
    {
      "level": 2,
      "title": "6. 퀴즈 앱",
      "slug": "_6-퀴즈-앱",
      "children": []
    },
    {
      "level": 2,
      "title": "➡️ 이 프로젝트 만들기",
      "slug": "➡️-이-프로젝트-만들기-5",
      "children": []
    },
    {
      "level": 2,
      "title": "7. 음악 플레이어",
      "slug": "_7-음악-플레이어",
      "children": []
    },
    {
      "level": 2,
      "title": "➡️ 이 프로젝트 만들기",
      "slug": "➡️-이-프로젝트-만들기-6",
      "children": []
    },
    {
      "level": 2,
      "title": "8. 레벨 편집기",
      "slug": "_8-레벨-편집기",
      "children": []
    },
    {
      "level": 2,
      "title": "➡️ 이 프로젝트 만들기",
      "slug": "➡️-이-프로젝트-만들기-7",
      "children": []
    },
    {
      "level": 2,
      "title": "9. AI 포스트 생성기",
      "slug": "_9-ai-포스트-생성기",
      "children": []
    },
    {
      "level": 2,
      "title": "➡️ 이 프로젝트 만들기",
      "slug": "➡️-이-프로젝트-만들기-8",
      "children": []
    },
    {
      "level": 2,
      "title": "10. GIF 갤러리",
      "slug": "_10-gif-갤러리",
      "children": []
    },
    {
      "level": 2,
      "title": "➡️ 이 프로젝트 만들기",
      "slug": "➡️-이-프로젝트-만들기-9",
      "children": []
    },
    {
      "level": 2,
      "title": "11. 채팅 앱",
      "slug": "_11-채팅-앱",
      "children": []
    },
    {
      "level": 2,
      "title": "➡️ 이 프로젝트 만들기",
      "slug": "➡️-이-프로젝트-만들기-10",
      "children": []
    },
    {
      "level": 2,
      "title": "12. 컬러 메모리 게임",
      "slug": "_12-컬러-메모리-게임",
      "children": []
    },
    {
      "level": 2,
      "title": "➡️ 이 프로젝트 만들기",
      "slug": "➡️-이-프로젝트-만들기-11",
      "children": []
    }
  ],
  "git": {
    "updatedTime": 1713854865000
  },
  "filePathRelative": "docs/Tech/2024-04-19-12ProjectstoBuildtoImproveYourCodingSkills/README.md"
}

if (import.meta.webpackHot) {
  import.meta.webpackHot.accept()
  if (__VUE_HMR_RUNTIME__.updatePageData) {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  }
}

if (import.meta.hot) {
  import.meta.hot.accept(({ data }) => {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  })
}
