export const data = {
  "key": "v-37f476e2",
  "path": "/docs/Tech/2024-03-22-FrontendMastersFeature-SlicedDesignFSDPattern/",
  "title": "프런트엔드 마스터스: 피처-슬라이스 디자인 (FSD) 패턴",
  "lang": "ko",
  "frontmatter": {
    "title": "프런트엔드 마스터스: 피처-슬라이스 디자인 (FSD) 패턴",
    "description": "",
    "date": "2024-03-22 23:32",
    "sidebarDepth": 0,
    "tag": "Tech",
    "thumbnail": null,
    "originalTitle": "Frontend Masters Feature-Sliced Design (FSD) Pattern",
    "link": "https://blog.stackademic.com/frontend-masters-feature-sliced-design-fsd-pattern-81416088b006"
  },
  "excerpt": "",
  "headers": [
    {
      "level": 2,
      "title": "복잡한 프로젝트를 맛있는 피자로 상상해보세요. 기능 슬라이싱이 어떻게 작동하는지 이해하려면 한 조각씩 나눠보면 됩니다. 쉽게 관리할 수 있고 맛있게 유지할 수 있어요! 🍕",
      "slug": "복잡한-프로젝트를-맛있는-피자로-상상해보세요-기능-슬라이싱이-어떻게-작동하는지-이해하려면-한-조각씩-나눠보면-됩니다-쉽게-관리할-수-있고-맛있게-유지할-수-있어요-🍕",
      "children": []
    },
    {
      "level": 2,
      "title": "레이어 및 슬라이스",
      "slug": "레이어-및-슬라이스",
      "children": []
    },
    {
      "level": 2,
      "title": "세그먼트(토핑):",
      "slug": "세그먼트-토핑",
      "children": []
    },
    {
      "level": 2,
      "title": "1. 폴더 구조 (피자 주방 조직):",
      "slug": "_1-폴더-구조-피자-주방-조직",
      "children": []
    },
    {
      "level": 2,
      "title": "2. 피자 조각 주문하기 (더 엑스트라바건자):",
      "slug": "_2-피자-조각-주문하기-더-엑스트라바건자",
      "children": []
    },
    {
      "level": 2,
      "title": "3. 피자 메뉴 세그먼트 (도우 베이스):",
      "slug": "_3-피자-메뉴-세그먼트-도우-베이스",
      "children": []
    },
    {
      "level": 2,
      "title": "4. 홈페이지 (피자 디스플레이 카운터):",
      "slug": "_4-홈페이지-피자-디스플레이-카운터",
      "children": []
    },
    {
      "level": 2,
      "title": "이 좋은 거 (조각들): 🍕",
      "slug": "이-좋은-거-조각들-🍕",
      "children": []
    },
    {
      "level": 2,
      "title": "그다지 좋지 않은 부분 (크러스트):👎🏻",
      "slug": "그다지-좋지-않은-부분-크러스트-👎🏻",
      "children": []
    },
    {
      "level": 2,
      "title": "결정:",
      "slug": "결정",
      "children": []
    }
  ],
  "git": {
    "updatedTime": 1711171735000
  },
  "filePathRelative": "docs/Tech/2024-03-22-FrontendMastersFeature-SlicedDesignFSDPattern/README.md"
}

if (import.meta.webpackHot) {
  import.meta.webpackHot.accept()
  if (__VUE_HMR_RUNTIME__.updatePageData) {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  }
}

if (import.meta.hot) {
  import.meta.hot.accept(({ data }) => {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  })
}
