export const data = {
  "key": "v-cd2b64ae",
  "path": "/docs/Design/2024-03-12-%EC%9B%B9-%EC%84%9C%EB%B9%84%EC%8A%A4-%EB%94%94%EC%9E%90%EC%9D%B8-%EC%8B%9C%EC%8A%A4%ED%85%9C-%EC%BB%AC%EB%9F%AC-%EC%84%A4%EA%B3%84-%ED%95%98%EB%8A%94-%EB%B0%A9%EB%B2%95/",
  "title": "웹 서비스 디자인 시스템 컬러 설계하는 방법",
  "lang": "ko",
  "frontmatter": {
    "title": "웹 서비스 디자인 시스템 컬러 설계하는 방법",
    "description": "웹 서비스를 위한 효과적인 디자인 시스템에서 컬러를 설계하는 방법에 대한 팁과 지침입니다.",
    "date": "2024-03-12 22:19",
    "sidebarDepth": 0,
    "tag": "디자인",
    "thumbnail": null
  },
  "excerpt": "",
  "headers": [
    {
      "level": 2,
      "title": "지속 가능한 시스템을 구축하기 위한 16가지 팁",
      "slug": "지속-가능한-시스템을-구축하기-위한-16가지-팁",
      "children": []
    },
    {
      "level": 2,
      "title": "#1. 브랜드 컬러를 빨리 안정화하라",
      "slug": "_1-브랜드-컬러를-빨리-안정화하라",
      "children": []
    },
    {
      "level": 2,
      "title": "#2. 브랜드 참여 (브랜드 컬러 변경 시)",
      "slug": "_2-브랜드-참여-브랜드-컬러-변경-시",
      "children": []
    },
    {
      "level": 2,
      "title": "#3. 중립색은 중립적이지 않게",
      "slug": "_3-중립색은-중립적이지-않게",
      "children": []
    },
    {
      "level": 2,
      "title": "#4. \"디지털 블루\"로 가라. 모두가 그렇게 한다.",
      "slug": "_4-디지털-블루-로-가라-모두가-그렇게-한다",
      "children": []
    },
    {
      "level": 2,
      "title": "#5. 각 색상별로 색조와 채도 범위 쌓기",
      "slug": "_5-각-색상별로-색조와-채도-범위-쌓기",
      "children": []
    },
    {
      "level": 2,
      "title": "#6. 밝기별로 색조와 채도에 이름 붙이기",
      "slug": "_6-밝기별로-색조와-채도에-이름-붙이기",
      "children": []
    },
    {
      "level": 2,
      "title": "#7. 색조와 채도의 양 제한하기",
      "slug": "_7-색조와-채도의-양-제한하기",
      "children": []
    },
    {
      "level": 2,
      "title": "#8. 변형 방법을 알려주라: 직접 선택 또는 기능적 선택",
      "slug": "_8-변형-방법을-알려주라-직접-선택-또는-기능적-선택",
      "children": []
    },
    {
      "level": 2,
      "title": "#9. 피드백 색상과 같은 의미 있는 세트 정의하기",
      "slug": "_9-피드백-색상과-같은-의미-있는-세트-정의하기",
      "children": []
    },
    {
      "level": 2,
      "title": "#10. 테마 다양성 설명하기",
      "slug": "_10-테마-다양성-설명하기",
      "children": []
    },
    {
      "level": 2,
      "title": "#11. 테마 작동 방식 정의하기",
      "slug": "_11-테마-작동-방식-정의하기",
      "children": []
    },
    {
      "level": 2,
      "title": "#12. 먼지가 날리기 전까지 컬러 믹싱 가이드 피하기",
      "slug": "_12-먼지가-날리기-전까지-컬러-믹싱-가이드-피하기",
      "children": []
    },
    {
      "level": 2,
      "title": "#13. 안전한 대비 비율을 식별하기",
      "slug": "_13-안전한-대비-비율을-식별하기",
      "children": []
    },
    {
      "level": 2,
      "title": "#14. 접근성 실패 후 처리 절차 구현하기",
      "slug": "_14-접근성-실패-후-처리-절차-구현하기",
      "children": []
    },
    {
      "level": 2,
      "title": "#15. 확대 배율을 고려한 색상 평가",
      "slug": "_15-확대-배율을-고려한-색상-평가",
      "children": []
    },
    {
      "level": 2,
      "title": "#16. 컬러 블라인드 브라우저 지원",
      "slug": "_16-컬러-블라인드-브라우저-지원",
      "children": []
    }
  ],
  "git": {
    "updatedTime": 1710251299000
  },
  "filePathRelative": "docs/Design/2024-03-12-웹-서비스-디자인-시스템-컬러-설계-하는-방법/README.md"
}
