export const data = {
  "key": "v-be60fc00",
  "path": "/docs/Tech/2024-03-29-CSSContainerquerieswhywemustconsidertheminFigmaandhowtoimplementthem/",
  "title": "Figma에 CSS 컨테이너 쿼리를 적용해야하는 이유와 방법",
  "lang": "ko",
  "frontmatter": {
    "title": "Figma에 CSS 컨테이너 쿼리를 적용해야하는 이유와 방법",
    "description": "",
    "date": "2024-03-29 10:28",
    "sidebarDepth": 0,
    "tag": "Tech",
    "thumbnail": null,
    "originalTitle": "CSS Container queries: why we must consider them in Figma and how to implement them",
    "link": "https://medium.com/user-experience-design-1/container-queries-why-its-time-to-consider-them-in-figma-and-how-to-implement-them-8e4e9349b8e4"
  },
  "excerpt": "",
  "headers": [
    {
      "level": 2,
      "title": "📚추가로 읽을 거리",
      "slug": "📚추가로-읽을-거리",
      "children": []
    },
    {
      "level": 2,
      "title": "Figma 변수 모드! 죄송하지만 이 부분은 실제로 작동하지 않아요.",
      "slug": "figma-변수-모드-죄송하지만-이-부분은-실제로-작동하지-않아요",
      "children": []
    },
    {
      "level": 2,
      "title": "단계 1: 두 가지 변형을 가진 구성 세트를 설정해봐요.",
      "slug": "단계-1-두-가지-변형을-가진-구성-세트를-설정해봐요",
      "children": []
    },
    {
      "level": 2,
      "title": "단계 2: 전환 지점 찾기",
      "slug": "단계-2-전환-지점-찾기",
      "children": []
    },
    {
      "level": 2,
      "title": "단계 3: 자동 레이아웃 및 최소 및 최대 값 추가.",
      "slug": "단계-3-자동-레이아웃-및-최소-및-최대-값-추가",
      "children": []
    },
    {
      "level": 2,
      "title": "단계 4: 모든 속성 명명이 일치하는지 확인합니다.",
      "slug": "단계-4-모든-속성-명명이-일치하는지-확인합니다",
      "children": []
    },
    {
      "level": 2,
      "title": "단계 5: 다른 사람들이 볼 것은 무엇인지 살펴봅시다.",
      "slug": "단계-5-다른-사람들이-볼-것은-무엇인지-살펴봅시다",
      "children": []
    },
    {
      "level": 2,
      "title": "조심해요, CSS 그리드가 아니라 개발 모드에서 플렉스박스 설정이에요!",
      "slug": "조심해요-css-그리드가-아니라-개발-모드에서-플렉스박스-설정이에요",
      "children": []
    },
    {
      "level": 2,
      "title": "단계 1: 컴포넌트 문서화에는 항상 섹션을 사용하세요!",
      "slug": "단계-1-컴포넌트-문서화에는-항상-섹션을-사용하세요",
      "children": []
    },
    {
      "level": 2,
      "title": "2. 구조",
      "slug": "_2-구조",
      "children": []
    },
    {
      "level": 2,
      "title": "3. 스펙",
      "slug": "_3-스펙",
      "children": []
    },
    {
      "level": 2,
      "title": "4. 상호작용 행동",
      "slug": "_4-상호작용-행동",
      "children": []
    },
    {
      "level": 2,
      "title": "5. 반응형 동작",
      "slug": "_5-반응형-동작",
      "children": []
    },
    {
      "level": 2,
      "title": "추가 정보: 그런데, 전통적인 그리드와 미디어 쿼리를 사용하는 경우, 반응형 정보는 다음과 같이 보일 수 있습니다:",
      "slug": "추가-정보-그런데-전통적인-그리드와-미디어-쿼리를-사용하는-경우-반응형-정보는-다음과-같이-보일-수-있습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "그리고 개발자 모드에서는 무엇을 볼까요:",
      "slug": "그리고-개발자-모드에서는-무엇을-볼까요",
      "children": []
    },
    {
      "level": 2,
      "title": "추가 자료:",
      "slug": "추가-자료",
      "children": []
    }
  ],
  "git": {
    "updatedTime": 1712272432000
  },
  "filePathRelative": "docs/Tech/2024-03-29-CSSContainerquerieswhywemustconsidertheminFigmaandhowtoimplementthem/README.md"
}

if (import.meta.webpackHot) {
  import.meta.webpackHot.accept()
  if (__VUE_HMR_RUNTIME__.updatePageData) {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  }
}

if (import.meta.hot) {
  import.meta.hot.accept(({ data }) => {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  })
}
