export const data = {
  "key": "v-b1d385b8",
  "path": "/docs/Tech/2024-04-19-101HilariousMemesThatWillMakeEverySoftwareEngineerGoROFL/",
  "title": "101 재미있는 개발자 밈: 소프트웨어 엔지니어가 전부 ROFL할 것입니다!",
  "lang": "ko",
  "frontmatter": {
    "title": "101 재미있는 개발자 밈: 소프트웨어 엔지니어가 전부 ROFL할 것입니다!",
    "description": "",
    "date": "2024-04-19 20:38",
    "sidebarDepth": 0,
    "tag": "Tech",
    "thumbnail": null,
    "originalTitle": "101 Hilarious Memes That Will Make Every Software Engineer Go ROFL",
    "link": "https://medium.com/fasal-engineering/funniest-software-development-memes-ever-f383ccf32a39"
  },
  "excerpt": "",
  "headers": [
    {
      "level": 2,
      "title": "CSS에 대해 사랑과 미움이 공존하는 분이 있다면 👏해주세요 🥲",
      "slug": "css에-대해-사랑과-미움이-공존하는-분이-있다면-👏해주세요-🥲",
      "children": []
    },
    {
      "level": 2,
      "title": "HTML 최고!",
      "slug": "html-최고",
      "children": []
    },
    {
      "level": 2,
      "title": "Node JS 엔지니어만이 이 고통을 이해할 것입니다 😪",
      "slug": "node-js-엔지니어만이-이-고통을-이해할-것입니다-😪",
      "children": []
    },
    {
      "level": 2,
      "title": "거의 완성!",
      "slug": "거의-완성",
      "children": []
    },
    {
      "level": 2,
      "title": "ES6 모듈 맛보고 난 후의 JS 개발자들",
      "slug": "es6-모듈-맛보고-난-후의-js-개발자들",
      "children": []
    },
    {
      "level": 2,
      "title": "아싸, 다시 시작해봅시다 😮‍💨",
      "slug": "아싸-다시-시작해봅시다-😮‍💨",
      "children": []
    },
    {
      "level": 2,
      "title": "실제 동작 방식 🥴",
      "slug": "실제-동작-방식-🥴",
      "children": []
    },
    {
      "level": 2,
      "title": "스택 오버플로우 없이 삶을 상상할 수 있나요? 나는 할 수 없어요 😶",
      "slug": "스택-오버플로우-없이-삶을-상상할-수-있나요-나는-할-수-없어요-😶",
      "children": []
    },
    {
      "level": 2,
      "title": "상대방: 인공지능이 인류를 파괴할 것이다!",
      "slug": "상대방-인공지능이-인류를-파괴할-것이다",
      "children": []
    },
    {
      "level": 2,
      "title": "가장 짧은 공포 이야기 🤢",
      "slug": "가장-짧은-공포-이야기-🤢",
      "children": []
    },
    {
      "level": 2,
      "title": "파괴, 나는 하네",
      "slug": "파괴-나는-하네",
      "children": []
    },
    {
      "level": 2,
      "title": "잠깐만요...",
      "slug": "잠깐만요",
      "children": []
    },
    {
      "level": 2,
      "title": "재귀에 대한 설명",
      "slug": "재귀에-대한-설명",
      "children": []
    },
    {
      "level": 2,
      "title": "PM을 사랑한다면 박수를 치세요 😈",
      "slug": "pm을-사랑한다면-박수를-치세요-😈",
      "children": []
    },
    {
      "level": 2,
      "title": "CSS — 모든 영역에서 가장 강력한 무기",
      "slug": "css-—-모든-영역에서-가장-강력한-무기",
      "children": []
    },
    {
      "level": 2,
      "title": "우리 모두 한 번쯤 그런 적이 있죠 🥲",
      "slug": "우리-모두-한-번쯤-그런-적이-있죠-🥲",
      "children": []
    },
    {
      "level": 2,
      "title": "이 코드가 무엇을 하는지 알려주는 사람은 바로 나예요 🥸",
      "slug": "이-코드가-무엇을-하는지-알려주는-사람은-바로-나예요-🥸",
      "children": []
    },
    {
      "level": 2,
      "title": "작동은 되는 걸 ✌️",
      "slug": "작동은-되는-걸-✌️",
      "children": []
    },
    {
      "level": 2,
      "title": "풀스택의 지배 🫡",
      "slug": "풀스택의-지배-🫡",
      "children": []
    },
    {
      "level": 2,
      "title": "댓글을 다는 것은 슈퍼파워입니다!!",
      "slug": "댓글을-다는-것은-슈퍼파워입니다",
      "children": []
    },
    {
      "level": 2,
      "title": "PR 댓글에서 나는 슬리퍼",
      "slug": "pr-댓글에서-나는-슬리퍼",
      "children": []
    },
    {
      "level": 2,
      "title": "Agile 개발 😐",
      "slug": "agile-개발",
      "children": []
    },
    {
      "level": 2,
      "title": "계속해서 작동합니다 😌",
      "slug": "계속해서-작동합니다-😌",
      "children": []
    },
    {
      "level": 2,
      "title": "그래서, 프로그래머들이 왜 독신일까요? 😒",
      "slug": "그래서-프로그래머들이-왜-독신일까요-😒",
      "children": []
    },
    {
      "level": 2,
      "title": "100%를 커버하고 있습니까?",
      "slug": "_100-를-커버하고-있습니까",
      "children": []
    },
    {
      "level": 2,
      "title": "이해해 😉",
      "slug": "이해해-😉",
      "children": []
    },
    {
      "level": 2,
      "title": "간단히 알아보는 HTTP 상태 코드",
      "slug": "간단히-알아보는-http-상태-코드",
      "children": []
    },
    {
      "level": 2,
      "title": "항상 일어나죠 🥲",
      "slug": "항상-일어나죠-🥲",
      "children": []
    },
    {
      "level": 2,
      "title": "깃은 필수!",
      "slug": "깃은-필수",
      "children": []
    },
    {
      "level": 2,
      "title": "다크 모드는 ❤️",
      "slug": "다크-모드는-❤️",
      "children": []
    },
    {
      "level": 2,
      "title": "소프트웨어 엔지니어들의 데스 게임",
      "slug": "소프트웨어-엔지니어들의-데스-게임",
      "children": []
    },
    {
      "level": 2,
      "title": "그냥 지나가는 중이에요?",
      "slug": "그냥-지나가는-중이에요",
      "children": []
    },
    {
      "level": 2,
      "title": "전혀 스트레스 받지 마세요!!!",
      "slug": "전혀-스트레스-받지-마세요",
      "children": []
    },
    {
      "level": 2,
      "title": "난 그의 주장이 정말 옳은 것 같아요 😄",
      "slug": "난-그의-주장이-정말-옳은-것-같아요-😄",
      "children": []
    },
    {
      "level": 2,
      "title": "난 똑똑함 😎",
      "slug": "난-똑똑함-😎",
      "children": []
    },
    {
      "level": 2,
      "title": "요즘 Linkedin",
      "slug": "요즘-linkedin",
      "children": []
    },
    {
      "level": 2,
      "title": "JS 개발자로서, 이것에 동의합니다 🫠",
      "slug": "js-개발자로서-이것에-동의합니다-🫠",
      "children": []
    },
    {
      "level": 2,
      "title": "아래 코멘트에 공유해주세요! 본받을만한 프로덕션 테스트 경험",
      "slug": "아래-코멘트에-공유해주세요-본받을만한-프로덕션-테스트-경험",
      "children": []
    },
    {
      "level": 2,
      "title": "UX에 대해도 이야기해봐요!",
      "slug": "ux에-대해도-이야기해봐요",
      "children": []
    },
    {
      "level": 2,
      "title": "아무도 원하지 않았지만 누구나 이루어져야 할 로고",
      "slug": "아무도-원하지-않았지만-누구나-이루어져야-할-로고",
      "children": []
    },
    {
      "level": 2,
      "title": "Python 개발자: 유일한 규칙은 규칙이 없다 😳",
      "slug": "python-개발자-유일한-규칙은-규칙이-없다-😳",
      "children": []
    },
    {
      "level": 2,
      "title": "절대적인 진실",
      "slug": "절대적인-진실",
      "children": []
    },
    {
      "level": 2,
      "title": "정규표현식은 정말 쉬워요",
      "slug": "정규표현식은-정말-쉬워요",
      "children": []
    },
    {
      "level": 2,
      "title": "알면 알수록 흥미로운 이야기 🤭",
      "slug": "알면-알수록-흥미로운-이야기-🤭",
      "children": []
    },
    {
      "level": 2,
      "title": "기계학습이 떠오르고 있어요",
      "slug": "기계학습이-떠오르고-있어요",
      "children": []
    },
    {
      "level": 2,
      "title": "꼭 그렇지는 않지만...",
      "slug": "꼭-그렇지는-않지만",
      "children": []
    },
    {
      "level": 2,
      "title": "경험해 봤어요",
      "slug": "경험해-봤어요",
      "children": []
    },
    {
      "level": 2,
      "title": "웃김",
      "slug": "웃김",
      "children": []
    },
    {
      "level": 2,
      "title": "“테스터와 개발자는 친구가 될 수 없다” — 예언",
      "slug": "테스터와-개발자는-친구가-될-수-없다-—-예언",
      "children": []
    },
    {
      "level": 2,
      "title": "논리 연산 설명",
      "slug": "논리-연산-설명",
      "children": []
    },
    {
      "level": 2,
      "title": "역사상 가장 오래된 농담 😌",
      "slug": "역사상-가장-오래된-농담-😌",
      "children": []
    },
    {
      "level": 2,
      "title": "맛있는 맛",
      "slug": "맛있는-맛",
      "children": []
    },
    {
      "level": 2,
      "title": "아, 이것도 아직 일어나나요?",
      "slug": "아-이것도-아직-일어나나요",
      "children": []
    },
    {
      "level": 2,
      "title": "힘들어요 🤧",
      "slug": "힘들어요-🤧",
      "children": []
    },
    {
      "level": 2,
      "title": "헤헤",
      "slug": "헤헤",
      "children": []
    },
    {
      "level": 2,
      "title": "VS Code 설정 변경 — 공포 소설 😵‍💫",
      "slug": "vs-code-설정-변경-—-공포-소설-😵‍💫",
      "children": []
    },
    {
      "level": 2,
      "title": "언제나 😓",
      "slug": "언제나-😓",
      "children": []
    },
    {
      "level": 2,
      "title": "대박이야 #$@%",
      "slug": "대박이야",
      "children": []
    },
    {
      "level": 2,
      "title": "어머나",
      "slug": "어머나",
      "children": []
    },
    {
      "level": 2,
      "title": "정확히",
      "slug": "정확히",
      "children": []
    },
    {
      "level": 2,
      "title": "프로그래머의 첫사랑",
      "slug": "프로그래머의-첫사랑",
      "children": []
    },
    {
      "level": 2,
      "title": "의미의 의미는 정말 무시하는 것 같아요",
      "slug": "의미의-의미는-정말-무시하는-것-같아요",
      "children": []
    },
    {
      "level": 2,
      "title": "최고의 데드락 예시",
      "slug": "최고의-데드락-예시",
      "children": []
    },
    {
      "level": 2,
      "title": "아헴 아헴",
      "slug": "아헴-아헴",
      "children": []
    },
    {
      "level": 2,
      "title": "적절한 표현",
      "slug": "적절한-표현",
      "children": []
    },
    {
      "level": 2,
      "title": "매일",
      "slug": "매일",
      "children": []
    },
    {
      "level": 2,
      "title": "다양한 종교에서 하나님의 이름이 다른 것처럼",
      "slug": "다양한-종교에서-하나님의-이름이-다른-것처럼",
      "children": []
    },
    {
      "level": 2,
      "title": "재미있는",
      "slug": "재미있는",
      "children": []
    },
    {
      "level": 2,
      "title": "사용자가 혼란을 일으킵니다",
      "slug": "사용자가-혼란을-일으킵니다",
      "children": []
    },
    {
      "level": 2,
      "title": "100%",
      "slug": "_100",
      "children": []
    },
    {
      "level": 2,
      "title": "그 느낌 이해해",
      "slug": "그-느낌-이해해",
      "children": []
    },
    {
      "level": 2,
      "title": "자주 일어나는 일 🤣",
      "slug": "자주-일어나는-일-🤣",
      "children": []
    },
    {
      "level": 2,
      "title": "의미 있는 이름",
      "slug": "의미-있는-이름",
      "children": []
    },
    {
      "level": 2,
      "title": "간단해",
      "slug": "간단해",
      "children": []
    },
    {
      "level": 2,
      "title": "자바스크립트는 붉은 약 💊",
      "slug": "자바스크립트는-붉은-약-💊",
      "children": []
    },
    {
      "level": 2,
      "title": "거짓말쟁이가 이곳저곳에",
      "slug": "거짓말쟁이가-이곳저곳에",
      "children": []
    },
    {
      "level": 2,
      "title": "우리 모두 자랑스럽지 않은 일을 하죠",
      "slug": "우리-모두-자랑스럽지-않은-일을-하죠",
      "children": []
    },
    {
      "level": 2,
      "title": "매번 반복되는 일",
      "slug": "매번-반복되는-일",
      "children": []
    },
    {
      "level": 2,
      "title": "우린 많은 걸 이겨냈어요 🙃",
      "slug": "우린-많은-걸-이겨냈어요-🙃",
      "children": []
    },
    {
      "level": 2,
      "title": "음..",
      "slug": "음",
      "children": []
    },
    {
      "level": 2,
      "title": "Temp V가 24시간이 지난 후에 떨어질 때",
      "slug": "temp-v가-24시간이-지난-후에-떨어질-때",
      "children": []
    },
    {
      "level": 2,
      "title": "도서관은 항상 잘못돼요 🤬",
      "slug": "도서관은-항상-잘못돼요-🤬",
      "children": []
    },
    {
      "level": 2,
      "title": "똑같아요",
      "slug": "똑같아요",
      "children": []
    },
    {
      "level": 2,
      "title": "세상이 타버리길 원하는 사람들이 있다는 걸요 🔥",
      "slug": "세상이-타버리길-원하는-사람들이-있다는-걸요-🔥",
      "children": []
    },
    {
      "level": 2,
      "title": "진실이 말해져써 🙃",
      "slug": "진실이-말해져써-🙃",
      "children": []
    },
    {
      "level": 2,
      "title": "너무 정확하네요 👌🏻",
      "slug": "너무-정확하네요-👌🏻",
      "children": []
    },
    {
      "level": 2,
      "title": "희망...",
      "slug": "희망",
      "children": []
    },
    {
      "level": 2,
      "title": "가끔은 해야해..",
      "slug": "가끔은-해야해",
      "children": []
    },
    {
      "level": 2,
      "title": "그렇죠, 그렇다구요",
      "slug": "그렇죠-그렇다구요",
      "children": []
    },
    {
      "level": 2,
      "title": "프로그래머 = 인간 압력솥",
      "slug": "프로그래머-인간-압력솥",
      "children": []
    },
    {
      "level": 2,
      "title": "옛날 방식은 결코 실패하지 않습니다",
      "slug": "옛날-방식은-결코-실패하지-않습니다",
      "children": []
    },
    {
      "level": 2,
      "title": "표시: 없음",
      "slug": "표시-없음",
      "children": []
    },
    {
      "level": 2,
      "title": "코드 이야기",
      "slug": "코드-이야기",
      "children": []
    },
    {
      "level": 2,
      "title": "내가 뭐할 수 있는지 보여줘",
      "slug": "내가-뭐할-수-있는지-보여줘",
      "children": []
    },
    {
      "level": 2,
      "title": "건드리지 말아주세요 🤢",
      "slug": "건드리지-말아주세요-🤢",
      "children": []
    },
    {
      "level": 2,
      "title": "하지만 그게 중요한 건가요?",
      "slug": "하지만-그게-중요한-건가요",
      "children": []
    },
    {
      "level": 2,
      "title": "돌아간다면 돌아간다는 거죠.",
      "slug": "돌아간다면-돌아간다는-거죠",
      "children": [
        {
          "level": 3,
          "title": "조심해야 해요",
          "slug": "조심해야-해요",
          "children": []
        },
        {
          "level": 3,
          "title": "소리쳐..",
          "slug": "소리쳐",
          "children": []
        }
      ]
    },
    {
      "level": 2,
      "title": "데브옵스 유머",
      "slug": "데브옵스-유머",
      "children": []
    },
    {
      "level": 2,
      "title": "스펠링 실수가 매우 전염성 있는 경우",
      "slug": "스펠링-실수가-매우-전염성-있는-경우",
      "children": []
    }
  ],
  "git": {
    "updatedTime": 1713854865000
  },
  "filePathRelative": "docs/Tech/2024-04-19-101HilariousMemesThatWillMakeEverySoftwareEngineerGoROFL/README.md"
}

if (import.meta.webpackHot) {
  import.meta.webpackHot.accept()
  if (__VUE_HMR_RUNTIME__.updatePageData) {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  }
}

if (import.meta.hot) {
  import.meta.hot.accept(({ data }) => {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  })
}
