<template><div><p>Storybook은 기여를 환영하는 커뮤니티 중심의 오픈 소스 프로젝트입니다. 대부분의 인기 있는 기능은 자신의 문제 해결을 원하는 개발자로부터 시작되었습니다.</p>
<h2 id="기여자-공약" tabindex="-1"><a class="header-anchor" href="#기여자-공약" aria-hidden="true">#</a> 기여자 공약</h2>
<p>열린 환경을 유지하고 환영하기 위해, 우리 기여자와 유지 관리자는 나이, 체형, 장애, 인종, 성 정체성 및 표현, 경험 수준, 국적, 외모, 인종, 종교, 또는 성 정체성과 성향에 관계없이 모든 사람들에게 괴롭힘이 없는 경험으로 프로젝트 및 커뮤니티 참여를 만들기로 약속합니다. 계속해서 우리의 기여자 공약을 읽어보세요 »</p>
<h2 id="기여하는-방법" tabindex="-1"><a class="header-anchor" href="#기여하는-방법" aria-hidden="true">#</a> 기여하는 방법</h2>
<ul>
<li>기능 요청 작성을 위한 RFC 프로세스</li>
<li>기능 및 버그 수정을 위한 코드</li>
<li>새로운 프레임워크 시작을 위한 프레임워크</li>
<li>문서 향상, 오타 및 명확화를 위한 문서</li>
<li>새로운 코드片 및 예제를 위한 예제</li>
<li>새로운 애드온을 위한 애드온</li>
</ul>
<h2 id="어떻게-시작할지-모르겠다면" tabindex="-1"><a class="header-anchor" href="#어떻게-시작할지-모르겠다면" aria-hidden="true">#</a> 어떻게 시작할지 모르겠다면?</h2>
<ul>
<li>디스코드 #기여 채널에서 채팅하십시오</li>
<li>수정할 &quot;좋은 첫 이슈&quot;를 찾아보세요</li>
<li>버그 신고 또는 기능 요청 제출</li>
</ul>
</div></template>
